app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params.fetch(:session).fetch(:email))
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin@admin.com"], ["LIMIT", 1]]